; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 551114 2 1 2 4 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	infrared0 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image1)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet8)
	(supports instrument1 image1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star3)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(have_image Star4 image1)
	(have_image Phenomenon5 image1)
	(have_image Phenomenon6 infrared0)
	(have_image Phenomenon7 image1)
	(have_image Planet8 infrared0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 5
3. (turn_to satellite0 star3 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star3)
   goals met: 0 of 5
4. (turn_to satellite1 planet8 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
5. (calibrate satellite0 instrument0 star3)
   added: (calibrated instrument0)
   goals met: 0 of 5
6. (turn_to satellite1 phenomenon7 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon7)
   goals met: 0 of 5
7. (turn_to satellite0 star4 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 star4)
   goals met: 0 of 5
8. (turn_to satellite1 planet8 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
9. (take_image satellite0 star4 instrument0 image1)
   added: (have_image star4 image1)
   goals met: 1 of 5
10. (turn_to satellite1 phenomenon6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon6)
   goals met: 1 of 5
11. (turn_to satellite0 phenomenon7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon7)
   goals met: 1 of 5
12. (turn_to satellite1 planet8 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 planet8)
   goals met: 1 of 5
13. (take_image satellite0 phenomenon7 instrument0 image1)
   added: (have_image phenomenon7 image1)
   goals met: 2 of 5
14. (turn_to satellite1 phenomenon5 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 phenomenon5)
   goals met: 2 of 5
15. (turn_to satellite0 phenomenon6 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 5
16. (turn_to satellite1 planet8 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 planet8)
   goals met: 2 of 5
17. (take_image satellite0 phenomenon6 instrument0 infrared0)
   added: (have_image phenomenon6 infrared0)
   goals met: 3 of 5
18. (turn_to satellite1 star3 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star3)
   goals met: 3 of 5
19. (turn_to satellite0 phenomenon5 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon5)
   goals met: 3 of 5
20. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 3 of 5
21. (take_image satellite0 phenomenon5 instrument0 image1)
   added: (have_image phenomenon5 image1)
   goals met: 4 of 5
22. (turn_to satellite1 planet8 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 planet8)
   goals met: 4 of 5
23. (take_image satellite1 planet8 instrument1 infrared0)
   added: (have_image planet8 infrared0)
   goals met: 5 of 5
